## Introduction

#### Our goals today are to be able to: <br/>

- Investigate table data in Pandas
- Manipulate Pandas DataFrames

In [12]:
list = [x**2 for x in range(1,11) if x%2 == 1]
print(list)

y = 15
x = y
x

[1, 9, 25, 49, 81]

15

### Activation:

![excel2](img/excelpic2.jpg)

Most people have used Microsoft Excel or Google sheets. But what are the limitations of excel?

- [Take a minute to read this article](https://www.bbc.com/news/magazine-22223190)
- make a list of problems excel presents

How is using python different?

Python
- create documentation of processes as you code
- reduces chances for human error
- do "drag and drop"
- repeatable
- transparent

## Pandas

<img src="https://cdn-images-1.medium.com/max/1600/1*9IU5fBzJisilYjRAi-f55Q.png" width=600>  




- The data manipulation capabilities of Pandas are built on top of the numpy library.
- Pandas dataframe object represents a spreadsheet with cell values, column names, and row index labels.

### 1. Importing and reading data with Pandas!

#### Let's use pandas to read some csv files so we can interact with them.

In [13]:
# First, let's check which directory we are in so the files we expect to see are there.
!pwd
!ls -la

/Users/yongweigao/Code/datascience/hbs-ds-060120/module-1/day-5-pandas-1
total 48
drwxr-xr-x   6 yongweigao  staff    192 Jun  5 10:50 .
drwxr-xr-x   8 yongweigao  staff    256 Jun  5 10:31 ..
drwxr-xr-x   3 yongweigao  staff     96 Jun  5 10:34 .ipynb_checkpoints
drwxr-xr-x   4 yongweigao  staff    128 Jun  5 10:31 data
drwxr-xr-x  12 yongweigao  staff    384 Jun  5 10:31 img
-rwxr-xr-x   1 yongweigao  staff  20853 Jun  5 10:50 pandas-1.ipynb

In [14]:
!ls -la data

total 16
drwxr-xr-x  4 yongweigao  staff  128 Jun  5 10:31 .
drwxr-xr-x  6 yongweigao  staff  192 Jun  5 10:50 ..
-rw-r--r--  1 yongweigao  staff   62 Jun  5 10:31 example1.csv
-rw-r--r--  1 yongweigao  staff  238 Jun  5 10:31 made_up_jobs.csv

In [2]:
import pandas as pd

example_csv = pd.read_csv('data/example1.csv')

In [3]:
!cat data/example1.csv

Title1,Title2,Title3
one,two,three
example1,example2,example3

In [4]:
example_csv

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

There is also `read_excel`, `read_html`, and many other pandas `read_` functions.  
http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [18]:
type(example_csv)

pandas.core.frame.DataFrame

In [20]:
type(example_csv.Title1)

pandas.core.series.Series

In [22]:
example_csv.Title1.values

array(['one', 'example1'], dtype=object)

In [21]:
example_csv.describe()

       Title1    Title2 Title3
count       2         2      2
unique      2         2      2
top       one  example2  three
freq        1         1      1

In [24]:
example_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
Title1    2 non-null object
Title2    2 non-null object
Title3    2 non-null object
dtypes: object(3)
memory usage: 128.0+ bytes

Try loading in the example file in the `data` directory called `made_up_jobs.csv` using pandas.

In [29]:
# read in your csv here!
muj = pd.read_csv('data/made_up_jobs.csv')

# remember that it's nice to be able to look at your data, so let's do that here, too.
muj.head()
muj

   ID            Name                       Job  Years Employed
0   0    Bob Bobberty  Underwater Basket Weaver              13
1   1    Susan Smells             Salad Spinner               5
2   2   Alex Lastname      Productivity Manager               2
3   3         Rudy P.                Being cool              55
4   4         Rudy G.  Being compared to Rudy P              50
5   5  Sir Wellington            Cheese Stacker              10

In [28]:
muj.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
ID                6 non-null int64
Name              6 non-null object
Job               6 non-null object
Years Employed    6 non-null int64
dtypes: int64(2), object(2)
memory usage: 272.0+ bytes

In [32]:
import numpy as np
random_df = pd.DataFrame(np.random.random((10000,10)))
random_df.tail(10)

,0,1,2,3,4,5,6,7,8,9
9990,0.636863,0.014902,0.341552,0.799121,0.834726,0.876329,0.327840,0.169678,0.471537,0.520924
9991,0.510406,0.204087,0.129008,0.362931,0.868185,0.777774,0.178856,0.059999,0.243553,0.637910
9992,0.148711,0.691121,0.823952,0.304357,0.153288,0.746078,0.363511,0.272942,0.108757,0.010038
9993,0.453300,0.277222,0.540631,0.345251,0.847825,0.529933,0.480289,0.551283,0.033491,0.548926
9994,0.465392,0.299507,0.423053,0.401762,0.366268,0.993853,0.836360,0.818070,0.416793,0.037419
9995,0.147836,0.954659,0.942003,0.754083,0.683678,0.528726,0.421355,0.129015,0.960901,0.552519
9996,0.493833,0.630443,0.961597,0.839073,0.506547,0.550942,0.357183,0.634747,0.110943,0.420408
9997,0.762856,0.711642,0.741496,0.022725,0.275958,0.180460,0.842847,0.897587,0.919071,0.110970
9998,0.746963,0.838554,0.757628,0.866736,0.527685,0.120295,0.577223,0.118864,0.845321,0.374417
9999,0.371477,0.757887,0.047047,0.398372,0.445191,0.381164,0.250220,0.051497,0.767368,0.113147

In [35]:
pd.DataFrame([[1,2,3],[4,None,6]]).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
0    2 non-null int64
1    1 non-null float64
2    2 non-null int64
dtypes: float64(1), int64(2)
memory usage: 128.0 bytes

### 2. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [36]:
fruits = ['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

In [37]:
[x.upper() for x in fruits]

['APPLE', 'ORANGE', 'WATERMELON', 'LEMON', 'MANGO']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [38]:
fruits_series = pd.Series(fruits)

print(fruits_series)
type(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

pandas.core.series.Series

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index manually for a **series objects**.

In [40]:
ind = ['a', 'b', 'c', 'd', 'e']

fruits_series = pd.Series(fruits, index=ind)

print(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [41]:
list_of_lists = [['cat'], ['dog'], ['horse'], ['cow'], ['macaw']]

# create custom indices for your series
ind = ['a', 'b', 'c', 'd', 'e']

elements=[x[0].lower() for x in list_of_lists]

# create the series using your list objects
# You can use either a for loop or also pd.Series
list_of_lists_series = pd.Series(elements, index=ind)

# print your series
print(list_of_lists_series)
type(list_of_lists_series)

a      cat
b      dog
c    horse
d      cow
e    macaw
dtype: object

pandas.core.series.Series

In [42]:
df = pd.DataFrame()

In [43]:
df['fruits'] = fruits_series

In [44]:
df['animals'] = list_of_lists_series

In [45]:
df

       fruits animals
a       Apple     cat
b      Orange     dog
c  Watermelon   horse
d       Lemon     cow
e       Mango   macaw

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [5]:
# Dictionary with list object in values
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [6]:
#to find data types of columns
students_df.dtypes

name    object
age     object
city    object
dtype: object

Let's change the data type of ages to int.

In [13]:
# We can also change a columns type but the change has to make sense.
students_df.age = students_df.age.astype(int)

#Uncomment line below and observe what happens when trying to convert student's name to int or float
#students_df.name = students_df.name.astype(int)

#How about what happens converting numeric to string
#students_df.age = students_df.age.astype(str)

students_df.dtypes

name    object
age      int64
city    object
dtype: object

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [14]:
school_ids = ['1111', '1145', '0096']

# Notice here we use pd.DataFrame not pd.Series as we did for a pandas series.
students_df = pd.DataFrame(student_dict, index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [15]:
students_df.index = students_df.index.rename('id')

In [16]:
students_df.head()

          name age      city
id
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Using Pandas, we can also rename column names.

In [17]:
students_df.columns

Index(['name', 'age', 'city'], dtype='object')

In [22]:
students_df.columns = ['NAME', 'AGE', 'HOME']
students_df.columns = [x.lower() for x in students_df.columns]
students_df.columns = [x.replace('n', 'd').upper() for x in students_df.columns]
students_df.head()

          DAME AGE      HOME
id
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Or, we can also change the column names using the rename function.

In [28]:
students_df.rename(columns={"AGE": "YEARS"})

          DAME YEARS      HOME
id
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [29]:
# Notice what happens when we print students_df

students_df

          DAME YEARS      HOME
id
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [41]:
# If you want the file to save over itself, use the option `inplace = True`.
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
students_df.head()

          DAME YEARS      HOME
id
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [42]:
students_dropped = students_df.drop(columns = ['YEARS', 'HOME'])
students_dropped

          DAME
id
1111  Samantha
1145      Alex
0096     Dante

In [31]:
students_df = students_df.rename(columns={'AGE': 'YEARS'})

Similarly, there is a tool to remove rows and columns from your DataFrame

In [49]:
skinny_df = students_df.drop(columns=['YEARS', 'HOME'])
skinny_df

          DAME
id
1111  Samantha
1145      Alex
0096     Dante

In [48]:
skinny_df.drop([0], axis=0)
skinny_df

KeyError: '[0] not found in axis'

In [36]:
#Notice again what happens if we print students_df 
students_df

          DAME YEARS      HOME
id
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [ ]:
students_df.drop(columns=['YEARS', 'HOME'], inplace=True)
students_df

In [50]:
my_df = pd.DataFrame([[1,2,3], [4,None,6]])
my_df

   0    1  2
0  1  2.0  3
1  4  NaN  6

In [51]:
my_df.dropna()

   0    1  2
0  1  2.0  3

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

### 3. Filtering Data Using Pandas
There are several ways to grab particular data from a DataFrame. 
- Python lists allow for selection of data only through integer location. 
- You can use a single integer or slice notation to make the selection but NOT a list of integers.
- Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [ ]:
l = [1, 2, 3, 4, 5]
l[[0, 5]]

### DataFrames can be indexed by column name (label) or row name (index) or by position.   
#### The `.loc` method is used for indexing by name.  
#### While `.iloc` is used for indexing by number.

In [52]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

In [58]:
students_df.loc[:, :]

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [57]:
students_df.loc[0:1, 'age':'city']

  age     city
0  35  Houston
1  17  Seattle

In [59]:
students_df.loc[:, 'name']

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

### Let's take a look at `.iloc`
#### `.iloc` takes slices based on index position.
#### `.iloc` stands for integer location so that should help with remember what it does
#### `.iloc`[row , column]

In [60]:
# returns the first row
students_df.iloc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [61]:
# returns the first column
students_df.iloc[:, 0]

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [65]:
students_df.loc[0:2]   #inclusive

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [62]:
# returns first two rows notice that ILOC performs regular python slicing.
students_df.iloc[0:2]

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

In [66]:
# returns the first two columns
students_df.iloc[:, 0:2]

       name age
0  Samantha  35
1      Alex  17
2     Dante  26

In [ ]:
# returns first row and columns 1 and 2
students_df.iloc[0:1, 0:2]

### How would we use `.iloc` to return the last item in the last row?

In [69]:
# return the last item in the last row using iloc
students_df.iloc[-1,-1]

'New york'

### How would we use `.iloc` to return the last item in the last column?

In [70]:
# return the last item in the last column using iloc
students_df.iloc[-1,-1]

'New york'

### What if we only want certain columns or rows?

In [71]:
# Don't do students_df.iloc[0, 2]
students_df.iloc[[0, 2]]

       name age      city
0  Samantha  35   Houston
2     Dante  26  New york

In [72]:
students_df.iloc[0,2]

'Houston'

In [ ]:
students_df.iloc[[0, 2], [0, 2]]

### Let's take a look at `.loc`
#### Label based method. 
#### Names or labels of the index is used when taking slices.
#### Also supports boolean subsetting.

In [98]:
# We will use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.
students_df

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [74]:
# returns the student information associated with index 0
students_df.loc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [75]:
# returns the student information for row index 0 to 2 inclusive.
# note iloc would return normal python slicing not including 2 as demonstrated above.
students_df.loc[0:2]

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [76]:
# returns the column labeled 'age'
students_df.loc[:, 'age']

0    35
1    17
2    26
Name: age, dtype: object

In [77]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age"
students_df.loc[1:2, 'age']

1    17
2    26
Name: age, dtype: object

In [78]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age to city (inclusive)"
students_df.loc[1:2, 'age':'city']

  age      city
1  17   Seattle
2  26  New york

In [79]:
# What should we get?
students_df.loc[1:2, ['name', 'city']]

    name      city
1   Alex   Seattle
2  Dante  New york

In [80]:
# How about?
students_df.loc[[0, 2], ['name', 'city']]

       name      city
0  Samantha   Houston
2     Dante  New york

In [81]:
# if index rearranged
school_ids = ['5', '11', '3']
students_df = pd.DataFrame(student_dict, index=school_ids)

In [96]:
students_df.reset_index().set_index('name')

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [97]:
students_df

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [89]:

# What should we get now?
students_df.loc[[5, 11], ['name', 
                          'city']]

KeyError: KeyError("None of [Int64Index([5, 11], dtype='int64')] are in the [index]")

In [90]:
# What should we get now?
students_df.loc[['5', '11'], 
                ['name', 'city']]

        name     city
5   Samantha  Houston
11      Alex  Seattle

In [91]:
students_df.set_index("name", inplace=True)
students_df

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [ ]:
student

In [92]:
students_df.loc[['Samantha']]

         age     city
name
Samantha  35  Houston

In [94]:
# Subsetting nonconsecutive rows
students_df.loc[['Samantha', 'Dante']]

         age      city
name
Samantha  35   Houston
Dante     26  New york

In [95]:
# Samantha to the end
students_df.loc['Samantha':]

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [ ]:
# return the first and last rows using one loc command

### Boolean Subsetting

In [99]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante', 'Samantha'],
    'age': ['35', '17', '26', '21'],
    'city': ['Houston', 'Seattle', 'New york', 'Atlanta'],
    'state': ['Texas', 'Washington', 'New York', 'Georgia']
}

students_df = pd.DataFrame(student_dict)

In [100]:
# The statement data[name] == Samantha] produces a Pandas Series with a True/False value for every row
# in the data DataFrame, where there are True values for the rows where the name is Samantha.
# These type of boolean arrays can be passed directly to the .loc indexer.
students_df.loc[students_df['name'] == 'Samantha']

       name age     city    state
0  Samantha  35  Houston    Texas
3  Samantha  21  Atlanta  Georgia

In [101]:
students_df[students_df['name'] == 'Samantha']

       name age     city    state
0  Samantha  35  Houston    Texas
3  Samantha  21  Atlanta  Georgia

In [102]:
# What about if we only want the city and state of the selected students with the name Samantha?
students_df.loc[students_df['name'] == 'Samantha', ['city', 'state']]

      city    state
0  Houston    Texas
3  Atlanta  Georgia

In [103]:
# What amount if we want to select a student of a specific age?
students_df.loc[students_df['age'] == '21']

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [104]:
# What amount if we want to select a student of a specific age?
students_df.loc[(students_df['age'] == '21') &
                (students_df['city'] == 'Atlanta')]

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [106]:
# What should be returned?
students_df.loc[(students_df['age'] == '35') &
                (students_df['city'] == 'Atlanta')]

Empty DataFrame
Columns: [name, age, city, state]
Index: []